{"format": "graph-model", "generatedBy": "2.14.0", "convertedBy": "TensorFlow.js Converter v4.13.0", "signature": {"inputs": {"input_41": {"name": "input_41:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "42"}]}}}, "outputs": {"dense_122": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "29"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_40/dense_120/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "42"}, {"size": "20"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_40/dense_120/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_40/dense_121/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20"}, {"size": "10"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_40/dense_121/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_40/dense_122/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}, {"size": "29"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_40/dense_122/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "29"}]}}}}}, {"name": "input_41", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "42"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_40/dense_120/Relu", "op": "_FusedMatMul", "input": ["input_41", "StatefulPartitionedCall/sequential_40/dense_120/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_40/dense_120/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_40/dense_121/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_40/dense_120/Relu", "StatefulPartitionedCall/sequential_40/dense_121/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_40/dense_121/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_b": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_40/dense_122/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_40/dense_121/Relu", "StatefulPartitionedCall/sequential_40/dense_122/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_40/dense_122/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_40/dense_122/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_40/dense_122/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_40/dense_122/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1575}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_40/dense_120/MatMul/ReadVariableOp", "shape": [42, 20], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_40/dense_120/BiasAdd/ReadVariableOp", "shape": [20], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_40/dense_121/MatMul/ReadVariableOp", "shape": [20, 10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_40/dense_121/BiasAdd/ReadVariableOp", "shape": [10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_40/dense_122/MatMul/ReadVariableOp", "shape": [10, 29], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_40/dense_122/BiasAdd/ReadVariableOp", "shape": [29], "dtype": "float32"}]}]}