{"format": "graph-model", "generatedBy": "2.14.0", "convertedBy": "TensorFlow.js Converter v4.13.0", "signature": {"inputs": {"input_39": {"name": "input_39:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "42"}]}}}, "outputs": {"dense_116": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "26"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_38/dense_114/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "42"}, {"size": "20"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_38/dense_114/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_38/dense_115/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20"}, {"size": "10"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_38/dense_115/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_38/dense_116/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}, {"size": "26"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_38/dense_116/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "26"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_39", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "42"}]}}}}, {"name": "StatefulPartitionedCall/sequential_38/dense_114/Relu", "op": "_FusedMatMul", "input": ["input_39", "StatefulPartitionedCall/sequential_38/dense_114/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_38/dense_114/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/sequential_38/dense_115/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_38/dense_114/Relu", "StatefulPartitionedCall/sequential_38/dense_115/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_38/dense_115/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_38/dense_116/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_38/dense_115/Relu", "StatefulPartitionedCall/sequential_38/dense_116/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_38/dense_116/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_38/dense_116/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_38/dense_116/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_38/dense_116/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1575}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_38/dense_114/MatMul/ReadVariableOp", "shape": [42, 20], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_38/dense_114/BiasAdd/ReadVariableOp", "shape": [20], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_38/dense_115/MatMul/ReadVariableOp", "shape": [20, 10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_38/dense_115/BiasAdd/ReadVariableOp", "shape": [10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_38/dense_116/MatMul/ReadVariableOp", "shape": [10, 26], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_38/dense_116/BiasAdd/ReadVariableOp", "shape": [26], "dtype": "float32"}]}]}