{"format": "graph-model", "generatedBy": "2.14.0", "convertedBy": "TensorFlow.js Converter v4.13.0", "signature": {"inputs": {"input_15": {"name": "input_15:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "42"}]}}}, "outputs": {"dense_44": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "6"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_14/dense_42/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "42"}, {"size": "20"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_14/dense_42/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_14/dense_43/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20"}, {"size": "10"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_14/dense_43/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_14/dense_44/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}, {"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_14/dense_44/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_15", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "42"}]}}}}, {"name": "StatefulPartitionedCall/sequential_14/dense_42/Relu", "op": "_FusedMatMul", "input": ["input_15", "StatefulPartitionedCall/sequential_14/dense_42/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_14/dense_42/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_14/dense_43/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_14/dense_42/Relu", "StatefulPartitionedCall/sequential_14/dense_43/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_14/dense_43/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_14/dense_44/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_14/dense_43/Relu", "StatefulPartitionedCall/sequential_14/dense_44/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_14/dense_44/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_14/dense_44/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_14/dense_44/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_14/dense_44/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1575}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_14/dense_42/MatMul/ReadVariableOp", "shape": [42, 20], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_14/dense_42/BiasAdd/ReadVariableOp", "shape": [20], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_14/dense_43/MatMul/ReadVariableOp", "shape": [20, 10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_14/dense_43/BiasAdd/ReadVariableOp", "shape": [10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_14/dense_44/MatMul/ReadVariableOp", "shape": [10, 6], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_14/dense_44/BiasAdd/ReadVariableOp", "shape": [6], "dtype": "float32"}]}]}