{"format": "graph-model", "generatedBy": "2.14.0", "convertedBy": "TensorFlow.js Converter v4.13.0", "signature": {"inputs": {"input_21": {"name": "input_21:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "42"}]}}}, "outputs": {"dense_62": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "12"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_20/dense_60/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "42"}, {"size": "20"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_20/dense_60/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_20/dense_61/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20"}, {"size": "10"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_20/dense_61/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_20/dense_62/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}, {"size": "12"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_20/dense_62/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12"}]}}}}}, {"name": "input_21", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "42"}]}}}}, {"name": "StatefulPartitionedCall/sequential_20/dense_60/Relu", "op": "_FusedMatMul", "input": ["input_21", "StatefulPartitionedCall/sequential_20/dense_60/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_20/dense_60/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_20/dense_61/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_20/dense_60/Relu", "StatefulPartitionedCall/sequential_20/dense_61/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_20/dense_61/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/sequential_20/dense_62/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_20/dense_61/Relu", "StatefulPartitionedCall/sequential_20/dense_62/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_20/dense_62/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_20/dense_62/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_20/dense_62/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_20/dense_62/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1575}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_20/dense_60/MatMul/ReadVariableOp", "shape": [42, 20], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_20/dense_60/BiasAdd/ReadVariableOp", "shape": [20], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_20/dense_61/MatMul/ReadVariableOp", "shape": [20, 10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_20/dense_61/BiasAdd/ReadVariableOp", "shape": [10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_20/dense_62/MatMul/ReadVariableOp", "shape": [10, 12], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_20/dense_62/BiasAdd/ReadVariableOp", "shape": [12], "dtype": "float32"}]}]}